app/apps/frontend/modules/site/controllers/DefaultController.php

    public function actionIndex($city = null)
    {
        $agencySearch = new AgencyAdvertSearch();
        $agencyDataProvider = $agencySearch->search(Yii::$app->request->queryParams);

        $partnersSearch = new PartnersAdvertSearch();
        $partnersAdverts = $partnersSearch->siteSearch(Yii::$app->request->queryParams);
        $articlesQuery = Article::find()->orderBy(['date_create' => SORT_DESC]);
        if (!is_null($city)) {
            $articlesQuery->where(['city' => $city]);
        } else {
            $articlesQuery->where('city IS NULL');
        }
        $articles = $articlesQuery->limit(1)->asArray()->all();
        $specialAdverts = SpecialAdvert::findActive();
        $articlesQuery2 = Article::find()
            ->orderBy(['date_create' => SORT_DESC]);

        if (!is_null($city)) {
            $articlesQuery2->where(['city' => $city]);
        } else {
            $articlesQuery2->where('city IS NULL');
        }

        $articlesall3 = $articlesQuery2->limit(12)->asArray()->all();
---
SELECT * FROM `articles` WHERE city IS NULL ORDER BY `date_create` DESC LIMIT 1
SELECT * FROM `articles` WHERE city IS NULL ORDER BY `date_create` DESC LIMIT 12