app/apps/frontend/components/View.php

    private function dbMetaTagsExists()
    {
        if ($this->dbTags !== null) {
            return (bool)$this->dbTags;
        }

        $requestedUrl = parse_url(Yii::$app->request->absoluteUrl);
        $domain = explode('.', $requestedUrl['host']);
        $domain = array_reverse($domain);

        // Берем третий уровень домена, предполагая, что доменное имя все же есть
        $subDomain = isset($domain[2]) ? $domain[2] : null;

        $dbTags = SeoSpecification::find()->where([
            'url' => $requestedUrl['path'],
            'city' => $subDomain
        ])->asArray()->one();
---
SELECT * FROM `seo_specifications` WHERE (`url`='/') AND (`city` IS NULL)