app/apps/frontend/modules/partners/models/search/AdvertSearch.php

    public function siteSearch($params)
    {
        if (!isset($params['rentType'])) $params['rentType'] = 'kvartira_na_sutki';

        $rentType = RentType::findRentTypeBySlug($params['rentType']);

        if (!$rentType) {
            return [];
        }

        $metro_array = null;
        if (isset($params['metro'])) {
            $metro_array = explode(',', $params['metro']);
            foreach ($metro_array as &$metro) {
                $metro = (int)$metro;
            }
        }

        return static::find()->distinct()->joinWith([
            'apartment' => function ($query) {
                $query->permitted()
                    ->with([
                        'city',
                        'adverts' => function ($query) {
                            $query->with('rentType');
                        },
                        'titleImage',

                    ])
                    ->joinWith([
                        'user' => function ($query) {
                            $query->banned(0);
                        },
                        'metroStation' => function ($query) {
                            $query->with('metro');
                        }
                    ]);
            },
        ])
            ->with('rentType')
            ->andWhere(['rent_type' => $rentType['rent_type_id'], 'city_id' => Yii::$app->getModule('agency')->mskCityId])
            ->andFilterWhere(['IN', 'metro_id', $metro_array])
            ->orderBy('CASE WHEN `position` = 0 THEN 1 ELSE 0 END,  `position` ASC')
            ->limit(12)
            ->all();
---
SELECT * FROM `metro` WHERE `metro_id` IN (96, 67, 105, 188, 74, 98, 171, 91, 199)